ci4/app/Controllers/Artikel.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $data = [
            'title' => $title,
            'artikel' => $model->getArtikelDenganKategori(),
            'kategori' => $kategoriModel->findAll(),