ci4/app/Controllers/Api/Auth.php

    public function login()
    {
        // 1. Menerima data input dari request body JSON Frontend
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $model = new UserModel();

        // 2. Cari user berdasarkan username atau email di database
        // PENTING JON: Kalau kolom di database lu namanya cuma 'email', ganti kata 'useremail' di bawah jadi 'email'
        $user = $model->where('username', $username)
                      ->orWhere('useremail', $username)
                      ->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin@email.com'
OR `useremail` = 'admin@email.com'
 LIMIT 1